Revit 2027 API
HostObjAttributes.GetCompoundStructure Method
Returns an object that represents the compound structure of the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CompoundStructure GetCompoundStructure()
Public Function GetCompoundStructure As CompoundStructure
public:
CompoundStructure^ GetCompoundStructure()
member GetCompoundStructure : unit -> CompoundStructure
Return Value
CompoundStructure
Remarks
A copy of the compound structure is returned and changes made to it will not apply to the type until SetCompoundStructure is called. From this object the layers of a compound structure can be accessed. If the element does not have a compound structure then this method will return null.
See Also
Reference
HostObjAttributes Class
Autodesk.Revit.DB Namespace